Repository: EricCoisa/AspNetCoreApiBase
Catalog: CoreApiBase/Resources/SharedResource.*.resx
Languages: es_es, pt_br

source: User not found.
es_es: Usuario no encontrado.
pt_br: Usuário não encontrado.

# ErrorRetrievingUsers
source: Error retrieving users: {0}
es_es: Error al obtener usuarios: {0}
pt_br: Erro ao buscar usuários: {0}

# ErrorRetrievingUser
source: Error retrieving user: {0}
es_es: Error al obtener usuario: {0}
pt_br: Erro ao buscar usuário: {0}

# ErrorCreatingUser
source: Error creating user: {0}
es_es: Error al crear usuario: {0}
pt_br: Erro ao criar usuário: {0}

# ErrorUpdatingUser
source: Error updating user: {0}
es_es: Error al actualizar usuario: {0}
pt_br: Erro ao atualizar usuário: {0}

# ErrorDeletingUser
source: Error deleting user: {0}
es_es: Error al eliminar usuario: {0}
pt_br: Erro ao excluir usuário: {0}

source: Invalid credentials.
es_es: Credenciales inválidas.
pt_br: Credenciais inválidas.

source: User created successfully.
es_es: Usuario creado exitosamente.
pt_br: Usuário criado com sucesso.

source: User updated successfully.
es_es: Usuario actualizado exitosamente.
pt_br: Usuário atualizado com sucesso.

source: User deleted successfully.
es_es: Usuario eliminado exitosamente.
pt_br: Usuário excluído com sucesso.

# Forbidden
source: Access forbidden.
es_es: Acceso denegado.
pt_br: Acesso negado.

source: Bad request.
es_es: Solicitud inválida.
pt_br: Solicitação inválida.

# UserExistsAlready
source: Username or email already exists.
es_es: Nombre de usuario o email ya existe.
pt_br: Nome de usuário ou email já existe.

source: User registered successfully.
es_es: Usuario registrado exitosamente.
pt_br: Usuário registrado com sucesso.

# RegistrationFailed
source: Registration failed: {0}
es_es: Fallo en el registro: {0}
pt_br: Falha no registro: {0}

source: Login successful.
es_es: Inicio de sesión exitoso.
pt_br: Login realizado com sucesso.

# LoginFailed
source: Login failed: {0}
es_es: Fallo en el inicio de sesión: {0}
pt_br: Falha no login: {0}

# ErrorRetrievingProfile
source: Error retrieving profile: {0}
es_es: Error al obtener perfil: {0}
pt_br: Erro ao buscar perfil: {0}

# ErrorRetrievingTokenInfo
source: Error retrieving token info: {0}
es_es: Error al obtener información del token: {0}
pt_br: Erro ao buscar informações do token: {0}

# TokensRevoked
source: Tokens revoked for user.
es_es: Tokens revocados para el usuario.
pt_br: Tokens revogados para o usuário.

# ErrorRevokingTokens
source: Error revoking tokens: {0}
es_es: Error al revocar tokens: {0}
pt_br: Erro ao revogar tokens: {0}

source: Unknown validation error
es_es: Error de validación desconocido
pt_br: Erro de validação desconhecido

# InvalidConfigurationInSection
source: Invalid configuration in section '{0}':
es_es: Configuración inválida en la sección '{0}':
pt_br: Configuração inválida na seção '{0}':

# InvalidConfigurationsFound
source: Invalid configurations found: {0}
es_es: Configuraciones inválidas encontradas: {0}
pt_br: Configurações inválidas encontradas: {0}

# ConfigurationHealthCheckFailed
source: Configuration health check failed: {0}
es_es: Health check de configuración falló: {0}
pt_br: Health check de configuração falhou: {0}

# ConfigurationHealthCheckPassed
source: Configuration health check passed successfully
es_es: Health check de configuración pasó exitosamente
pt_br: Health check de configuração passou com sucesso

# AllEssentialConfigurationsValid
source: All essential configurations are valid
es_es: Todas las configuraciones esenciales son válidas
pt_br: Todas as configurações essenciais estão válidas

# UnexpectedErrorDuringHealthCheck
source: Unexpected error during configuration health check
es_es: Error inesperado durante health check de configuración
pt_br: Erro inesperado durante health check de configuração

# UnexpectedError
source: Unexpected error: {0}
es_es: Error inesperado: {0}
pt_br: Erro inesperado: {0}

# JwtErrorAccessingConfigurations
source: JWT: Error accessing configurations - {0}
es_es: JWT: Error al acceder a configuraciones - {0}
pt_br: JWT: Erro ao acessar configurações - {0}

# DatabaseErrorAccessingConfigurations
source: Database: Error accessing configurations - {0}
es_es: Database: Error al acceder a configuraciones - {0}
pt_br: Database: Erro ao acessar configurações - {0}

# CorsInsecureConfiguration
source: CORS: Insecure configuration - AllowCredentials=true with AllowedOrigins=*
es_es: CORS: Configuración insegura - AllowCredentials=true con AllowedOrigins=*
pt_br: CORS: Configuração insegura - AllowCredentials=true com AllowedOrigins=*

# CorsErrorAccessingConfigurations
source: CORS: Error accessing configurations - {0}
es_es: CORS: Error al acceder a configuraciones - {0}
pt_br: CORS: Erro ao acessar configurações - {0}

# JwtSecretKeyRequired
source: JWT SecretKey is required
es_es: JWT SecretKey es requerido
pt_br: JWT SecretKey é obrigatório

# ConnectionStringRequired
source: Connection String is required
es_es: Connection String es requerida
pt_br: Connection String é obrigatória

# ConfigurationRequiredTitle
source: 🔧 CONFIGURATION REQUIRED - ASP.NET Core API Base
es_es: 🔧 CONFIGURACIÓN REQUERIDA - ASP.NET Core API Base
pt_br: 🔧 CONFIGURAÇÃO NECESSÁRIA - ASP.NET Core API Base

# MandatoryConfigurationsMissing
source: ❌ Mandatory configurations are missing:
es_es: ❌ Configuraciones obligatorias están faltando:
pt_br: ❌ Configurações obrigatórias estão faltando:

# SolutionExecuteConfigurationScript
source: ✅ SOLUTION: Execute the configuration script
es_es: ✅ SOLUCIÓN: Ejecute el script de configuración
pt_br: ✅ SOLUÇÃO: Execute o script de configuração

source: Steps:
es_es: Pasos:
pt_br: Passos:

# StepOpenTerminal
source: 1. Open a terminal in the project root directory
es_es: 1. Abra un terminal en el directorio raíz del proyecto
pt_br: 1. Abra um terminal no diretório raiz do projeto

# StepExecuteScript
source: 2. Execute: start setup-configuration.bat development
es_es: 2. Ejecute: start setup-configuration.bat development

# StepRunProjectAgain
source: 3. Run the project again
es_es: 3. Ejecute el proyecto nuevamente
pt_br: 3. Execute o projeto novamente

# DetailedInstructionsSaved
source: 📄 Detailed instructions saved in: {0}
es_es: 📄 Instrucciones detalladas guardadas en: {0}
pt_br: 📄 Instruções detalhadas salvas em: {0}

source: 🐳 RUNNING IN DOCKER CONTAINER
es_es: 🐳 EJECUTANDO EN CONTENEDOR DOCKER
pt_br: 🐳 EXECUTANDO EM CONTAINER DOCKER

source: ❌ Mandatory configurations not found:
es_es: ❌ Configuraciones obligatorias no encontradas:
pt_br: ❌ Configurações obrigatórias não encontradas:

source: 🔧 CONTAINER SOLUTIONS:
es_es: 🔧 SOLUCIONES PARA CONTENEDOR:
pt_br: 🔧 SOLUÇÕES PARA CONTAINER:

# StopCurrentContainer
source: 1️⃣ STOP current container:
es_es: 1️⃣ DETENER contenedor actual:
pt_br: 1️⃣ PARAR o container atual:

# ConfigureSecretsOnHost
source: 2️⃣ CONFIGURE secrets on host:
es_es: 2️⃣ CONFIGURAR secrets en el host:
pt_br: 2️⃣ CONFIGURAR secrets no host:

# RestartContainer
source: 3️⃣ RESTART container:
es_es: 3️⃣ REINICIAR contenedor:
pt_br: 3️⃣ REINICIAR o container:

# JwtSecretKeyRequiredValidation
source: JWT SecretKey is required
es_es: JWT SecretKey es requerido
pt_br: JWT SecretKey é obrigatório

# JwtSecretKeyMinLengthValidation
source: JWT SecretKey must have at least 32 characters for security
es_es: JWT SecretKey debe tener al menos 32 caracteres para seguridad
pt_br: JWT SecretKey deve ter pelo menos 32 caracteres para segurança

# JwtIssuerRequiredValidation
source: JWT Issuer is required
es_es: JWT Issuer es requerido
pt_br: JWT Issuer é obrigatório

# JwtIssuerUrlValidation
source: JWT Issuer must be a valid URL
es_es: JWT Issuer debe ser una URL válida
pt_br: JWT Issuer deve ser uma URL válida

# JwtAudienceRequiredValidation
source: JWT Audience is required
es_es: JWT Audience es requerido
pt_br: JWT Audience é obrigatório

# JwtAudienceUrlValidation
source: JWT Audience must be a valid URL
es_es: JWT Audience debe ser una URL válida
pt_br: JWT Audience deve ser uma URL válida

# JwtExpiryMinutesValidation
source: JWT ExpiryMinutes must be greater than 0
es_es: JWT ExpiryMinutes debe ser mayor que 0
pt_br: JWT ExpiryMinutes deve ser maior que 0

# AllowedOriginsRequiredValidation
source: AllowedOrigins is required
es_es: AllowedOrigins es requerido
pt_br: AllowedOrigins é obrigatório

# AllowedOriginsMinLengthValidation
source: Must have at least one allowed origin
es_es: Debe tener al menos un origen permitido
pt_br: Deve ter pelo menos uma origem permitida

# PreflightMaxAgeValidation
source: PreflightMaxAge must be >= 0
es_es: PreflightMaxAge debe ser >= 0
pt_br: PreflightMaxAge deve ser >= 0

# ConnectionStringRequiredValidation
source: Connection String is required
es_es: Connection String es requerida
pt_br: Connection String é obrigatória

# ConnectionStringMinLengthValidation
source: Connection String must have at least 10 characters
es_es: Connection String debe tener al menos 10 caracteres
pt_br: Connection String deve ter pelo menos 10 caracteres

# CommandTimeoutValidation
source: CommandTimeout must be between 1 and 300 seconds
es_es: CommandTimeout debe estar entre 1 y 300 segundos
pt_br: CommandTimeout deve estar entre 1 e 300 segundos
